In [1]:
import pandas as pd
import sqlite3

In [2]:
cnx = sqlite3.connect("base_datos_proveedores.db")

In [3]:
cursor_prov = cnx.cursor()

In [4]:
query = '''
CREATE TABLE proveedores (
id_proveedor INT PRIMARY KEY,
nombre TEXT NOT NULL,
direccion TEXT NOT NULL,
ciudad TEXT NOT NULL,
provincia TEXT NOT NULL
) 
'''
cursor_prov.execute(query)

OperationalError: table proveedores already exists

In [ ]:
query = ''' 
SELECT *
FROM sqlite_master
WHERE type = "table"
'''
pd.read_sql(query, cnx)

,type,name,tbl_name,rootpage,sql
0,table,proveedores,proveedores,2,CREATE TABLE proveedores (\nid_proveedor INT P...

In [ ]:
query = ''' 
SELECT *
FROM proveedores
'''
pd.read_sql(query, cnx)

Empty DataFrame
Columns: [id_proveedor, nombre, direccion, ciudad, provincia]
Index: []

In [ ]:
query = '''
CREATE TABLE piezas (
id_pieza INT PRIMARY KEY,
nombre TEXT NOT NULL,
color TEXT NOT NULL,
precio FLOAT NOT NULL,
categoria TEXT NOT NULL
) 
'''
cursor_prov.execute(query)

In [ ]:
query = ''' 
SELECT *
FROM sqlite_master
WHERE type = "table"
'''
pd.read_sql(query, cnx)

,type,name,tbl_name,rootpage,sql
0,table,proveedores,proveedores,2,CREATE TABLE proveedores (\nid_proveedor INT P...
1,table,piezas,piezas,4,CREATE TABLE piezas (\nid_pieza INT PRIMARY KE...

In [ ]:
query = '''
CREATE TABLE categoria_pieza (
id_categoria INT PRIMARY KEY,
nombre_categoria TEXT NOT NULL
) 
'''
cursor_prov.execute(query)

In [ ]:
query = ''' 
SELECT *
FROM sqlite_master
WHERE type = "table"
'''
pd.read_sql(query, cnx)

,type,name,tbl_name,rootpage,sql
0,table,proveedores,proveedores,2,CREATE TABLE proveedores (\nid_proveedor INT P...
1,table,piezas,piezas,4,CREATE TABLE piezas (\nid_pieza INT PRIMARY KE...
2,table,categoria_pieza,categoria_pieza,6,CREATE TABLE categoria_pieza (\nid_categoria I...

In [ ]:
query = ''' 
SELECT *
FROM categoria_pieza
'''
pd.read_sql(query, cnx)

Empty DataFrame
Columns: [id_categoria, nombre_categoria]
Index: []

In [ ]:
query = '''
CREATE TABLE operaciones (
id_operacion INT PRIMARY KEY,
id_proveedor INT NOT NULL,
id_pieza INT NOT NULL,
fecha TEXT NOT NULL,
id_factura INT NOT NULL
) 
'''
cursor_prov.execute(query)

In [ ]:
query = ''' 
SELECT *
FROM sqlite_master
WHERE type = "table"
'''
pd.read_sql(query, cnx)

,type,name,tbl_name,rootpage,sql
0,table,proveedores,proveedores,2,CREATE TABLE proveedores (\nid_proveedor INT P...
1,table,piezas,piezas,4,CREATE TABLE piezas (\nid_pieza INT PRIMARY KE...
2,table,categoria_pieza,categoria_pieza,6,CREATE TABLE categoria_pieza (\nid_categoria I...
3,table,operaciones,operaciones,8,CREATE TABLE operaciones (\nid_operacion INT P...

In [ ]:
query = '''
CREATE TABLE facturas (
id_factura INT PRIMARY KEY,
id_proveedor INT NOT NULL,
id_pieza INT NOT NULL,
cantidad_piezas INT NOT NULL,
precio_ud INT NOT NULL,
total INT NOT NULL,
fecha_factura TEXT NOT NULL
) 
'''
cursor_prov.execute(query)

In [ ]:
query = ''' 
SELECT *
FROM sqlite_master
WHERE type = "table"
'''
pd.read_sql(query, cnx)

,type,name,tbl_name,rootpage,sql
0,table,proveedores,proveedores,2,CREATE TABLE proveedores (\nid_proveedor INT P...
1,table,piezas,piezas,4,CREATE TABLE piezas (\nid_pieza INT PRIMARY KE...
2,table,categoria_pieza,categoria_pieza,6,CREATE TABLE categoria_pieza (\nid_categoria I...
3,table,operaciones,operaciones,8,CREATE TABLE operaciones (\nid_operacion INT P...
4,table,facturas,facturas,10,CREATE TABLE facturas (\nid_factura INT PRIMAR...

In [ ]:
query = ''' 
ALTER TABLE categoria_pieza
ADD COLUMN id_pieza VARCHAR(50)
'''
cnx.execute(query)

OperationalError: duplicate column name: id_pieza

In [ ]:
query = ''' 
SELECT *
FROM categoria_pieza
'''
pd.read_sql(query, cnx)

Empty DataFrame
Columns: [id_categoria, nombre_categoria, id_pieza]
Index: []

In [10]:
from faker import Faker
import random

fake = Faker("es_ES")

categorias_piezas_coche = ["Motor","Suspensión","Frenos","Transmisión","Escape","Refrigeración","Electrónica","Iluminación","Carrocería","Neumáticos"]
#no he encontraod nada de faker que me devuelva nombres válidos para las categorías, asi que los pongo en una lista y que los elija aleatoriamente

categoria_info_list = []

for _ in range(10):
    id_categoria = fake.uuid4()[:8] #los he reducido a 8 caracteres porque salia un id muy largo
    nombre_categoria = random.choice(categorias_piezas_coche)
    categorias_piezas_coche.remove(nombre_categoria)

    categoria_info_list.append((id_categoria, nombre_categoria))


    print(f"id_categoria: {id_categoria}, nombre_categoría: {nombre_categoria}")

id_categoria: cca6698a, nombre_categoría: Neumáticos
id_categoria: 0f60b577, nombre_categoría: Carrocería
id_categoria: 77f94cef, nombre_categoría: Suspensión
id_categoria: ece3916f, nombre_categoría: Electrónica
id_categoria: 39ae6f90, nombre_categoría: Escape
id_categoria: 1e89a299, nombre_categoría: Motor
id_categoria: 9c3454c7, nombre_categoría: Transmisión
id_categoria: 3b71e090, nombre_categoría: Frenos
id_categoria: b21b3a8c, nombre_categoría: Iluminación
id_categoria: 20077a85, nombre_categoría: Refrigeración

In [22]:
query = ''' 
INSERT INTO categoria_pieza (id_categoria, nombre_categoria)
VALUES (?, ?) 
'''

In [24]:
for id_categoria, nombre_categoria in categoria_info_list:  #cnx.executemany()
    cnx.execute(query, (id_categoria, nombre_categoria))

IntegrityError: UNIQUE constraint failed: categoria_pieza.id_categoria

In [ ]:
query = ''' 
SELECT *
FROM categoria_pieza
'''
pd.read_sql(query, cnx)

  id_categoria nombre_categoria id_pieza
0     5b873307      Iluminación     None
1     b9f2ece5       Suspensión     None
2     fa0d268e       Carrocería     None
3     40eddc77    Refrigeración     None
4     e37490d4           Escape     None
5     f0f3a0ff           Frenos     None
6     f0226ce7       Neumáticos     None
7     2caf6d5a      Transmisión     None
8     03da27b3            Motor     None
9     eb69ccf4      Electrónica     None

In [ ]:
#me he dadoc uenta de que no puedo añadir id_pieza a mi tabla porque debería haber más id_piezas que id_categorias (y en mi caso debe ser key)
#en todo caso, creo que mi id_categoria deberia estar en la tabla piezas de Marta, y en todo caso deberia haber mas datos en piezas que en categoria (o menos en categoría)